interface RegionsData {
  [key: string]: {
    [key: string]: {
      key: string;
      name: string;
    };
  };
}

export const regionsData: RegionsData = {
  '00': {
    '1': {
      key: '北京',
      name: '北京',
    },
    '2': {
      key: '天津',
      name: '天津',
    },
    '3': {
      key: '河北',
      name: '河北省',
    },
    '4': {
      key: '山西',
      name: '山西省',
    },
    '5': {
      key: '内蒙古',
      name: '内蒙古自治区',
    },
    '6': {
      key: '辽宁',
      name: '辽宁省',
    },
    '7': {
      key: '吉林',
      name: '吉林省',
    },
    '8': {
      key: '黑龙江',
      name: '黑龙江省',
    },
    '9': {
      key: '上海',
      name: '上海',
    },
    '10': {
      key: '江苏',
      name: '江苏省',
    },
    '11': {
      key: '浙江',
      name: '浙江省',
    },
    '12': {
      key: '安徽',
      name: '安徽省',
    },
    '13': {
      key: '福建',
      name: '福建省',
    },
    '14': {
      key: '江西',
      name: '江西省',
    },
    '15': {
      key: '山东',
      name: '山东省',
    },
    '16': {
      key: '河南',
      name: '河南省',
    },
    '17': {
      key: '湖北',
      name: '湖北省',
    },
    '18': {
      key: '湖南',
      name: '湖南省',
    },
    '19': {
      key: '广东',
      name: '广东省',
    },
    '20': {
      key: '广西',
      name: '广西壮族自治区',
    },
    '21': {
      key: '海南',
      name: '海南省',
    },
    '22': {
      key: '重庆',
      name: '重庆',
    },
    '23': {
      key: '四川',
      name: '四川省',
    },
    '24': {
      key: '贵州',
      name: '贵州省',
    },
    '25': {
      key: '云南',
      name: '云南省',
    },
    '26': {
      key: '西藏',
      name: '西藏自治区',
    },
    '27': {
      key: '陕西',
      name: '陕西省',
    },
    '28': {
      key: '甘肃',
      name: '甘肃省',
    },
    '29': {
      key: '青海',
      name: '青海省',
    },
    '30': {
      key: '宁夏',
      name: '宁夏回族自治区',
    },
    '31': {
      key: '新疆',
      name: '新疆维吾尔自治区',
    },
    '32': {
      key: '台湾',
      name: '台湾',
    },
    '33': {
      key: '香港',
      name: '香港特别行政区',
    },
    '34': {
      key: '澳门',
      name: '澳门特别行政区',
    },
    '35': {
      key: '海外',
      name: '海外',
    },
  },
  '1': {
    '36': {
      key: '北京',
      name: '北京市',
    },
  },
  '2': {
    '37': {
      key: '天津',
      name: '天津市',
    },
  },
  '3': {
    '38': {
      key: '石家庄',
      name: '石家庄市',
    },
    '39': {
      key: '唐山',
      name: '唐山市',
    },
    '40': {
      key: '秦皇岛',
      name: '秦皇岛市',
    },
    '41': {
      key: '邯郸',
      name: '邯郸市',
    },
    '42': {
      key: '邢台',
      name: '邢台市',
    },
    '43': {
      key: '保定',
      name: '保定市',
    },
    '44': {
      key: '张家口',
      name: '张家口市',
    },
    '45': {
      key: '承德',
      name: '承德市',
    },
    '46': {
      key: '沧州',
      name: '沧州市',
    },
    '47': {
      key: '廊坊',
      name: '廊坊市',
    },
    '48': {
      key: '衡水',
      name: '衡水市',
    },
  },
  '4': {
    '49': {
      key: '太原',
      name: '太原市',
    },
    '50': {
      key: '大同',
      name: '大同市',
    },
    '51': {
      key: '阳泉',
      name: '阳泉市',
    },
    '52': {
      key: '长治',
      name: '长治市',
    },
    '53': {
      key: '晋城',
      name: '晋城市',
    },
    '54': {
      key: '朔州',
      name: '朔州市',
    },
    '55': {
      key: '晋中',
      name: '晋中市',
    },
    '56': {
      key: '运城',
      name: '运城市',
    },
    '57': {
      key: '忻州',
      name: '忻州市',
    },
    '58': {
      key: '临汾',
      name: '临汾市',
    },
    '59': {
      key: '吕梁',
      name: '吕梁市',
    },
  },
  '5': {
    '60': {
      key: '呼和浩特',
      name: '呼和浩特市',
    },
    '61': {
      key: '包头',
      name: '包头市',
    },
    '62': {
      key: '乌海',
      name: '乌海市',
    },
    '63': {
      key: '赤峰',
      name: '赤峰市',
    },
    '64': {
      key: '通辽',
      name: '通辽市',
    },
    '65': {
      key: '鄂尔多斯',
      name: '鄂尔多斯市',
    },
    '66': {
      key: '呼伦贝尔',
      name: '呼伦贝尔市',
    },
    '67': {
      key: '巴彦淖尔',
      name: '巴彦淖尔市',
    },
    '68': {
      key: '乌兰察布',
      name: '乌兰察布市',
    },
    '69': {
      key: '兴安盟',
      name: '兴安盟',
    },
    '70': {
      key: '锡林郭勒盟',
      name: '锡林郭勒盟',
    },
    '71': {
      key: '阿拉善盟',
      name: '阿拉善盟',
    },
  },
  '6': {
    '72': {
      key: '沈阳',
      name: '沈阳市',
    },
    '73': {
      key: '大连',
      name: '大连市',
    },
    '74': {
      key: '鞍山',
      name: '鞍山市',
    },
    '75': {
      key: '抚顺',
      name: '抚顺市',
    },
    '76': {
      key: '本溪',
      name: '本溪市',
    },
    '77': {
      key: '丹东',
      name: '丹东市',
    },
    '78': {
      key: '锦州',
      name: '锦州市',
    },
    '79': {
      key: '营口',
      name: '营口市',
    },
    '80': {
      key: '阜新',
      name: '阜新市',
    },
    '81': {
      key: '辽阳',
      name: '辽阳市',
    },
    '82': {
      key: '盘锦',
      name: '盘锦市',
    },
    '83': {
      key: '铁岭',
      name: '铁岭市',
    },
    '84': {
      key: '朝阳',
      name: '朝阳市',
    },
    '85': {
      key: '葫芦岛',
      name: '葫芦岛市',
    },
  },
  '7': {
    '86': {
      key: '长春',
      name: '长春市',
    },
    '87': {
      key: '吉林',
      name: '吉林市',
    },
    '88': {
      key: '四平',
      name: '四平市',
    },
    '89': {
      key: '辽源',
      name: '辽源市',
    },
    '90': {
      key: '通化',
      name: '通化市',
    },
    '91': {
      key: '白山',
      name: '白山市',
    },
    '92': {
      key: '松原',
      name: '松原市',
    },
    '93': {
      key: '白城',
      name: '白城市',
    },
    '94': {
      key: '延边',
      name: '延边朝鲜族自治州',
    },
  },
  '8': {
    '95': {
      key: '哈尔滨',
      name: '哈尔滨市',
    },
    '96': {
      key: '齐齐哈尔',
      name: '齐齐哈尔市',
    },
    '97': {
      key: '鸡西',
      name: '鸡西市',
    },
    '98': {
      key: '鹤岗',
      name: '鹤岗市',
    },
    '99': {
      key: '双鸭山',
      name: '双鸭山市',
    },
    '100': {
      key: '大庆',
      name: '大庆市',
    },
    '101': {
      key: '伊春',
      name: '伊春市',
    },
    '102': {
      key: '佳木斯',
      name: '佳木斯市',
    },
    '103': {
      key: '七台河',
      name: '七台河市',
    },
    '104': {
      key: '牡丹江',
      name: '牡丹江市',
    },
    '105': {
      key: '黑河',
      name: '黑河市',
    },
    '106': {
      key: '绥化',
      name: '绥化市',
    },
    '107': {
      key: '大兴安岭',
      name: '大兴安岭地区',
    },
  },
  '9': {
    '108': {
      key: '上海',
      name: '上海市',
    },
  },
  '10': {
    '109': {
      key: '南京',
      name: '南京市',
    },
    '110': {
      key: '无锡',
      name: '无锡市',
    },
    '111': {
      key: '徐州',
      name: '徐州市',
    },
    '112': {
      key: '常州',
      name: '常州市',
    },
    '113': {
      key: '苏州',
      name: '苏州市',
    },
    '114': {
      key: '南通',
      name: '南通市',
    },
    '115': {
      key: '连云港',
      name: '连云港市',
    },
    '116': {
      key: '淮安',
      name: '淮安市',
    },
    '117': {
      key: '盐城',
      name: '盐城市',
    },
    '118': {
      key: '扬州',
      name: '扬州市',
    },
    '119': {
      key: '镇江',
      name: '镇江市',
    },
    '120': {
      key: '泰州',
      name: '泰州市',
    },
    '121': {
      key: '宿迁',
      name: '宿迁市',
    },
  },
  '11': {
    '122': {
      key: '杭州',
      name: '杭州市',
    },
    '123': {
      key: '宁波',
      name: '宁波市',
    },
    '124': {
      key: '温州',
      name: '温州市',
    },
    '125': {
      key: '嘉兴',
      name: '嘉兴市',
    },
    '126': {
      key: '湖州',
      name: '湖州市',
    },
    '127': {
      key: '绍兴',
      name: '绍兴市',
    },
    '128': {
      key: '金华',
      name: '金华市',
    },
    '129': {
      key: '衢州',
      name: '衢州市',
    },
    '130': {
      key: '舟山',
      name: '舟山市',
    },
    '131': {
      key: '台州',
      name: '台州市',
    },
    '132': {
      key: '丽水',
      name: '丽水市',
    },
  },
  '12': {
    '133': {
      key: '合肥',
      name: '合肥市',
    },
    '134': {
      key: '芜湖',
      name: '芜湖市',
    },
    '135': {
      key: '蚌埠',
      name: '蚌埠市',
    },
    '136': {
      key: '淮南',
      name: '淮南市',
    },
    '137': {
      key: '马鞍山',
      name: '马鞍山市',
    },
    '138': {
      key: '淮北',
      name: '淮北市',
    },
    '139': {
      key: '铜陵',
      name: '铜陵市',
    },
    '140': {
      key: '安庆',
      name: '安庆市',
    },
    '141': {
      key: '黄山',
      name: '黄山市',
    },
    '142': {
      key: '滁州',
      name: '滁州市',
    },
    '143': {
      key: '阜阳',
      name: '阜阳市',
    },
    '144': {
      key: '宿州',
      name: '宿州市',
    },
    '145': {
      key: '六安',
      name: '六安市',
    },
    '146': {
      key: '亳州',
      name: '亳州市',
    },
    '147': {
      key: '池州',
      name: '池州市',
    },
    '148': {
      key: '宣城',
      name: '宣城市',
    },
  },
  '13': {
    '149': {
      key: '福州',
      name: '福州市',
    },
    '150': {
      key: '厦门',
      name: '厦门市',
    },
    '151': {
      key: '莆田',
      name: '莆田市',
    },
    '152': {
      key: '三明',
      name: '三明市',
    },
    '153': {
      key: '泉州',
      name: '泉州市',
    },
    '154': {
      key: '漳州',
      name: '漳州市',
    },
    '155': {
      key: '南平',
      name: '南平市',
    },
    '156': {
      key: '龙岩',
      name: '龙岩市',
    },
    '157': {
      key: '宁德',
      name: '宁德市',
    },
  },
  '14': {
    '158': {
      key: '南昌',
      name: '南昌市',
    },
    '159': {
      key: '景德镇',
      name: '景德镇市',
    },
    '160': {
      key: '萍乡',
      name: '萍乡市',
    },
    '161': {
      key: '九江',
      name: '九江市',
    },
    '162': {
      key: '新余',
      name: '新余市',
    },
    '163': {
      key: '鹰潭',
      name: '鹰潭市',
    },
    '164': {
      key: '赣州',
      name: '赣州市',
    },
    '165': {
      key: '吉安',
      name: '吉安市',
    },
    '166': {
      key: '宜春',
      name: '宜春市',
    },
    '167': {
      key: '抚州',
      name: '抚州市',
    },
    '168': {
      key: '上饶',
      name: '上饶市',
    },
  },
  '15': {
    '169': {
      key: '济南',
      name: '济南市',
    },
    '170': {
      key: '青岛',
      name: '青岛市',
    },
    '171': {
      key: '淄博',
      name: '淄博市',
    },
    '172': {
      key: '枣庄',
      name: '枣庄市',
    },
    '173': {
      key: '东营',
      name: '东营市',
    },
    '174': {
      key: '烟台',
      name: '烟台市',
    },
    '175': {
      key: '潍坊',
      name: '潍坊市',
    },
    '176': {
      key: '济宁',
      name: '济宁市',
    },
    '177': {
      key: '泰安',
      name: '泰安市',
    },
    '178': {
      key: '威海',
      name: '威海市',
    },
    '179': {
      key: '日照',
      name: '日照市',
    },
    '180': {
      key: '莱芜',
      name: '莱芜市',
    },
    '181': {
      key: '临沂',
      name: '临沂市',
    },
    '182': {
      key: '德州',
      name: '德州市',
    },
    '183': {
      key: '聊城',
      name: '聊城市',
    },
    '184': {
      key: '滨州',
      name: '滨州市',
    },
    '185': {
      key: '菏泽',
      name: '菏泽市',
    },
  },
  '16': {
    '186': {
      key: '郑州',
      name: '郑州市',
    },
    '187': {
      key: '开封',
      name: '开封市',
    },
    '188': {
      key: '洛阳',
      name: '洛阳市',
    },
    '189': {
      key: '平顶山',
      name: '平顶山市',
    },
    '190': {
      key: '安阳',
      name: '安阳市',
    },
    '191': {
      key: '鹤壁',
      name: '鹤壁市',
    },
    '192': {
      key: '新乡',
      name: '新乡市',
    },
    '193': {
      key: '焦作',
      name: '焦作市',
    },
    '194': {
      key: '濮阳',
      name: '濮阳市',
    },
    '195': {
      key: '许昌',
      name: '许昌市',
    },
    '196': {
      key: '漯河',
      name: '漯河市',
    },
    '197': {
      key: '三门峡',
      name: '三门峡市',
    },
    '198': {
      key: '南阳',
      name: '南阳市',
    },
    '199': {
      key: '商丘',
      name: '商丘市',
    },
    '200': {
      key: '信阳',
      name: '信阳市',
    },
    '201': {
      key: '周口',
      name: '周口市',
    },
    '202': {
      key: '驻马店',
      name: '驻马店市',
    },
  },
  '17': {
    '203': {
      key: '武汉',
      name: '武汉市',
    },
    '204': {
      key: '黄石',
      name: '黄石市',
    },
    '205': {
      key: '十堰',
      name: '十堰市',
    },
    '206': {
      key: '宜昌',
      name: '宜昌市',
    },
    '207': {
      key: '襄阳',
      name: '襄阳市',
    },
    '208': {
      key: '鄂州',
      name: '鄂州市',
    },
    '209': {
      key: '荆门',
      name: '荆门市',
    },
    '210': {
      key: '孝感',
      name: '孝感市',
    },
    '211': {
      key: '荆州',
      name: '荆州市',
    },
    '212': {
      key: '黄冈',
      name: '黄冈市',
    },
    '213': {
      key: '咸宁',
      name: '咸宁市',
    },
    '214': {
      key: '随州',
      name: '随州市',
    },
    '215': {
      key: '恩施',
      name: '恩施土家族苗族自治州',
    },
  },
  '18': {
    '216': {
      key: '长沙',
      name: '长沙市',
    },
    '217': {
      key: '株洲',
      name: '株洲市',
    },
    '218': {
      key: '湘潭',
      name: '湘潭市',
    },
    '219': {
      key: '衡阳',
      name: '衡阳市',
    },
    '220': {
      key: '邵阳',
      name: '邵阳市',
    },
    '221': {
      key: '岳阳',
      name: '岳阳市',
    },
    '222': {
      key: '常德',
      name: '常德市',
    },
    '223': {
      key: '张家界',
      name: '张家界市',
    },
    '224': {
      key: '益阳',
      name: '益阳市',
    },
    '225': {
      key: '郴州',
      name: '郴州市',
    },
    '226': {
      key: '永州',
      name: '永州市',
    },
    '227': {
      key: '怀化',
      name: '怀化市',
    },
    '228': {
      key: '娄底',
      name: '娄底市',
    },
    '229': {
      key: '湘西',
      name: '湘西土家族苗族自治州',
    },
  },
  '19': {
    '230': {
      key: '广州',
      name: '广州市',
    },
    '231': {
      key: '韶关',
      name: '韶关市',
    },
    '232': {
      key: '深圳',
      name: '深圳市',
    },
    '233': {
      key: '珠海',
      name: '珠海市',
    },
    '234': {
      key: '汕头',
      name: '汕头市',
    },
    '235': {
      key: '佛山',
      name: '佛山市',
    },
    '236': {
      key: '江门',
      name: '江门市',
    },
    '237': {
      key: '湛江',
      name: '湛江市',
    },
    '238': {
      key: '茂名',
      name: '茂名市',
    },
    '239': {
      key: '肇庆',
      name: '肇庆市',
    },
    '240': {
      key: '惠州',
      name: '惠州市',
    },
    '241': {
      key: '梅州',
      name: '梅州市',
    },
    '242': {
      key: '汕尾',
      name: '汕尾市',
    },
    '243': {
      key: '河源',
      name: '河源市',
    },
    '244': {
      key: '阳江',
      name: '阳江市',
    },
    '245': {
      key: '清远',
      name: '清远市',
    },
    '246': {
      key: '东莞',
      name: '东莞市',
    },
    '247': {
      key: '中山',
      name: '中山市',
    },
    '248': {
      key: '东沙群岛',
      name: '东沙群岛',
    },
    '249': {
      key: '潮州',
      name: '潮州市',
    },
    '250': {
      key: '揭阳',
      name: '揭阳市',
    },
    '251': {
      key: '云浮',
      name: '云浮市',
    },
  },
  '20': {
    '252': {
      key: '南宁',
      name: '南宁市',
    },
    '253': {
      key: '柳州',
      name: '柳州市',
    },
    '254': {
      key: '桂林',
      name: '桂林市',
    },
    '255': {
      key: '梧州',
      name: '梧州市',
    },
    '256': {
      key: '北海',
      name: '北海市',
    },
    '257': {
      key: '防城港',
      name: '防城港市',
    },
    '258': {
      key: '钦州',
      name: '钦州市',
    },
    '259': {
      key: '贵港',
      name: '贵港市',
    },
    '260': {
      key: '玉林',
      name: '玉林市',
    },
    '261': {
      key: '百色',
      name: '百色市',
    },
    '262': {
      key: '贺州',
      name: '贺州市',
    },
    '263': {
      key: '河池',
      name: '河池市',
    },
    '264': {
      key: '来宾',
      name: '来宾市',
    },
    '265': {
      key: '崇左',
      name: '崇左市',
    },
  },
  '21': {
    '266': {
      key: '海口',
      name: '海口市',
    },
    '267': {
      key: '三亚',
      name: '三亚市',
    },
    '268': {
      key: '三沙',
      name: '三沙市',
    },
  },
  '22': {
    '269': {
      key: '重庆',
      name: '重庆市',
    },
  },
  '23': {
    '270': {
      key: '成都',
      name: '成都市',
    },
    '271': {
      key: '自贡',
      name: '自贡市',
    },
    '272': {
      key: '攀枝花',
      name: '攀枝花市',
    },
    '273': {
      key: '泸州',
      name: '泸州市',
    },
    '274': {
      key: '德阳',
      name: '德阳市',
    },
    '275': {
      key: '绵阳',
      name: '绵阳市',
    },
    '276': {
      key: '广元',
      name: '广元市',
    },
    '277': {
      key: '遂宁',
      name: '遂宁市',
    },
    '278': {
      key: '内江',
      name: '内江市',
    },
    '279': {
      key: '乐山',
      name: '乐山市',
    },
    '280': {
      key: '南充',
      name: '南充市',
    },
    '281': {
      key: '眉山',
      name: '眉山市',
    },
    '282': {
      key: '宜宾',
      name: '宜宾市',
    },
    '283': {
      key: '广安',
      name: '广安市',
    },
    '284': {
      key: '达州',
      name: '达州市',
    },
    '285': {
      key: '雅安',
      name: '雅安市',
    },
    '286': {
      key: '巴中',
      name: '巴中市',
    },
    '287': {
      key: '资阳',
      name: '资阳市',
    },
    '288': {
      key: '阿坝',
      name: '阿坝藏族羌族自治州',
    },
    '289': {
      key: '甘孜',
      name: '甘孜藏族自治州',
    },
    '290': {
      key: '凉山',
      name: '凉山彝族自治州',
    },
  },
  '24': {
    '291': {
      key: '贵阳',
      name: '贵阳市',
    },
    '292': {
      key: '六盘水',
      name: '六盘水市',
    },
    '293': {
      key: '遵义',
      name: '遵义市',
    },
    '294': {
      key: '安顺',
      name: '安顺市',
    },
    '295': {
      key: '铜仁',
      name: '铜仁市',
    },
    '296': {
      key: '黔西南',
      name: '黔西南布依族苗族自治州',
    },
    '297': {
      key: '毕节',
      name: '毕节市',
    },
    '298': {
      key: '黔东南',
      name: '黔东南苗族侗族自治州',
    },
    '299': {
      key: '黔南布',
      name: '黔南布依族苗族自治州',
    },
  },
  '25': {
    '300': {
      key: '昆明',
      name: '昆明市',
    },
    '301': {
      key: '曲靖',
      name: '曲靖市',
    },
    '302': {
      key: '玉溪',
      name: '玉溪市',
    },
    '303': {
      key: '保山',
      name: '保山市',
    },
    '304': {
      key: '昭通',
      name: '昭通市',
    },
    '305': {
      key: '丽江',
      name: '丽江市',
    },
    '306': {
      key: '普洱',
      name: '普洱市',
    },
    '307': {
      key: '临沧',
      name: '临沧市',
    },
    '308': {
      key: '楚雄',
      name: '楚雄彝族自治州',
    },
    '309': {
      key: '红河',
      name: '红河哈尼族彝族自治州',
    },
    '310': {
      key: '文山',
      name: '文山壮族苗族自治州',
    },
    '311': {
      key: '西双版纳',
      name: '西双版纳傣族自治州',
    },
    '312': {
      key: '大理',
      name: '大理白族自治州',
    },
    '313': {
      key: '德宏',
      name: '德宏傣族景颇族自治州',
    },
    '314': {
      key: '怒江',
      name: '怒江傈僳族自治州',
    },
    '315': {
      key: '迪庆',
      name: '迪庆藏族自治州',
    },
  },
  '26': {
    '316': {
      key: '拉萨',
      name: '拉萨市',
    },
    '317': {
      key: '昌都',
      name: '昌都市',
    },
    '318': {
      key: '山南',
      name: '山南地区',
    },
    '319': {
      key: '日喀则',
      name: '日喀则市',
    },
    '320': {
      key: '那曲',
      name: '那曲地区',
    },
    '321': {
      key: '阿里',
      name: '阿里地区',
    },
    '322': {
      key: '林芝',
      name: '林芝市',
    },
  },
  '27': {
    '323': {
      key: '西安',
      name: '西安市',
    },
    '324': {
      key: '铜川',
      name: '铜川市',
    },
    '325': {
      key: '宝鸡',
      name: '宝鸡市',
    },
    '326': {
      key: '咸阳',
      name: '咸阳市',
    },
    '327': {
      key: '渭南',
      name: '渭南市',
    },
    '328': {
      key: '延安',
      name: '延安市',
    },
    '329': {
      key: '汉中',
      name: '汉中市',
    },
    '330': {
      key: '榆林',
      name: '榆林市',
    },
    '331': {
      key: '安康',
      name: '安康市',
    },
    '332': {
      key: '商洛',
      name: '商洛市',
    },
  },
  '28': {
    '333': {
      key: '兰州',
      name: '兰州市',
    },
    '334': {
      key: '嘉峪关',
      name: '嘉峪关市',
    },
    '335': {
      key: '金昌',
      name: '金昌市',
    },
    '336': {
      key: '白银',
      name: '白银市',
    },
    '337': {
      key: '天水',
      name: '天水市',
    },
    '338': {
      key: '武威',
      name: '武威市',
    },
    '339': {
      key: '张掖',
      name: '张掖市',
    },
    '340': {
      key: '平凉',
      name: '平凉市',
    },
    '341': {
      key: '酒泉',
      name: '酒泉市',
    },
    '342': {
      key: '庆阳',
      name: '庆阳市',
    },
    '343': {
      key: '定西',
      name: '定西市',
    },
    '344': {
      key: '陇南',
      name: '陇南市',
    },
    '345': {
      key: '临夏',
      name: '临夏回族自治州',
    },
    '346': {
      key: '甘南',
      name: '甘南藏族自治州',
    },
  },
  '29': {
    '347': {
      key: '西宁',
      name: '西宁市',
    },
    '348': {
      key: '海东',
      name: '海东市',
    },
    '349': {
      key: '海北',
      name: '海北藏族自治州',
    },
    '350': {
      key: '黄南',
      name: '黄南藏族自治州',
    },
    '351': {
      key: '海南',
      name: '海南藏族自治州',
    },
    '352': {
      key: '果洛',
      name: '果洛藏族自治州',
    },
    '353': {
      key: '玉树',
      name: '玉树藏族自治州',
    },
    '354': {
      key: '海西',
      name: '海西蒙古族藏族自治州',
    },
  },
  '30': {
    '355': {
      key: '银川',
      name: '银川市',
    },
    '356': {
      key: '石嘴山',
      name: '石嘴山市',
    },
    '357': {
      key: '吴忠',
      name: '吴忠市',
    },
    '358': {
      key: '固原',
      name: '固原市',
    },
    '359': {
      key: '中卫',
      name: '中卫市',
    },
  },
  '31': {
    '360': {
      key: '乌鲁木齐',
      name: '乌鲁木齐市',
    },
    '361': {
      key: '克拉玛依',
      name: '克拉玛依市',
    },
    '362': {
      key: '吐鲁番',
      name: '吐鲁番市',
    },
    '363': {
      key: '哈密',
      name: '哈密地区',
    },
    '364': {
      key: '昌吉',
      name: '昌吉回族自治州',
    },
    '365': {
      key: '博尔塔拉',
      name: '博尔塔拉蒙古自治州',
    },
    '366': {
      key: '巴音郭楞',
      name: '巴音郭楞蒙古自治州',
    },
    '367': {
      key: '阿克苏',
      name: '阿克苏地区',
    },
    '368': {
      key: '克孜勒苏柯尔克孜',
      name: '克孜勒苏柯尔克孜自治州',
    },
    '369': {
      key: '喀什',
      name: '喀什地区',
    },
    '370': {
      key: '和田',
      name: '和田地区',
    },
    '371': {
      key: '伊犁哈萨克',
      name: '伊犁哈萨克自治州',
    },
    '372': {
      key: '塔城',
      name: '塔城地区',
    },
    '373': {
      key: '阿勒泰',
      name: '阿勒泰地区',
    },
  },
  '32': {
    '374': {
      key: '台北',
      name: '台北市',
    },
    '375': {
      key: '高雄',
      name: '高雄市',
    },
    '376': {
      key: '台南',
      name: '台南市',
    },
    '377': {
      key: '台中',
      name: '台中市',
    },
    '378': {
      key: '金门',
      name: '金门县',
    },
    '379': {
      key: '南投',
      name: '南投县',
    },
    '380': {
      key: '基隆',
      name: '基隆市',
    },
    '381': {
      key: '新竹',
      name: '新竹市',
    },
    '382': {
      key: '嘉义',
      name: '嘉义市',
    },
    '383': {
      key: '新北',
      name: '新北市',
    },
    '384': {
      key: '宜兰',
      name: '宜兰县',
    },
    '385': {
      key: '新竹',
      name: '新竹县',
    },
    '386': {
      key: '桃园',
      name: '桃园县',
    },
    '387': {
      key: '苗栗',
      name: '苗栗县',
    },
    '388': {
      key: '彰化',
      name: '彰化县',
    },
    '389': {
      key: '嘉义',
      name: '嘉义县',
    },
    '390': {
      key: '云林',
      name: '云林县',
    },
    '391': {
      key: '屏东',
      name: '屏东县',
    },
    '392': {
      key: '台东',
      name: '台东县',
    },
    '393': {
      key: '花莲',
      name: '花莲县',
    },
    '394': {
      key: '澎湖',
      name: '澎湖县',
    },
    '395': {
      key: '连江',
      name: '连江县',
    },
  },
  '33': {
    '396': {
      key: '香港',
      name: '香港岛',
    },
    '397': {
      key: '九龙',
      name: '九龙',
    },
    '398': {
      key: '新界',
      name: '新界',
    },
  },
  '34': {
    '399': {
      key: '澳门',
      name: '澳门半岛',
    },
    '400': {
      key: '离岛',
      name: '离岛',
    },
  },
  '35': {
    '401': {
      key: '海外',
      name: '海外',
    },
  },
};
